[{"_id":{"$oid":"5a3e3a803de5f119cc971dd2"},"user":"","name":"Proof of Concept Safe Helicopter landing Test Solution","content":"\u003cp\u003eShip Helicopter Operational Limits (SHOL) is een term die wordt gebruikt voor de limitatie van het landen door een helikopter op een specifiek schip. Momenteel worden deze limieten bepaald door middel van het uitgebreid testen op zee aan de hand van de bekende limieten voor het landen op het land.\u003c/p\u003e\n\n\u003cp\u003eSHOL-X is een methodiek die een SHOL kan voorspellen en verifi\u0026euml;ren. Hiertoe wordt data gebruikt die is verzameld met windtunnel testen voor specifieke helikopter en schip combinaties. Deze data kan worden gebruikt voor het automatisch genereren van een Candidate Flight Envelope (CFE). Hiermee kan vervolgens aan de hand van een met de hand gemaakt testplan een specifieker gebied getest worden om de SHOL te verifi\u0026euml;ren. Dit zorgt voor lagere operationele kosten voor het testen op zee.\u003c/p\u003e\n\n\u003cp\u003eIk heb meegewerkt aan het ontwikkelen van een Proof of Concept voor een software oplossing voor SHOL-X. Hierbij heb ik requirement analyse, planning, tijdschatting en onderzoek gedaan naar mogelijkheden voor de programeertaal van de implementatie.\u003c/p\u003e\n\n\u003cp\u003eDit proof of concept moet worden gedemonstreerd en aan de hand van feedback worden aangepast.\u003c/p\u003e\n\n\u003cp\u003eVerder heb ik de\u0026nbsp;onderstaande taken uitgevoerd:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eHet weergeven van co\u0026ouml;rdinaten nadat er geklikt is op het grafiek\u003c/li\u003e\n\u0009\u003cli\u003eExporteren van een grafiek naar een afbeelding\u003c/li\u003e\n\u0009\u003cli\u003eExporteren van data naar een excel bestand\u003c/li\u003e\n\u0009\u003cli\u003eRefactoren van code\u003c/li\u003e\n\u0009\u003cli\u003eWeergeven van berichten nadat een handeling is gedaan\u003c/li\u003e\n\u0009\u003cli\u003eHet bedenken van functionaliteiten die in de applicatie ge\u0026iuml;mplementeerd moeten worden in de PoC applicatie voor NLR. I.p.v. dat deze functionaliteiten al als requirements zijn bedacht door de informatieanalist of door de klant.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eDe technieken waarmee ik heb gewerkt zijn:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eJava EE 7\u003c/li\u003e\n\u0009\u003cli\u003eApache\u003c/li\u003e\n\u0009\u003cli\u003e.NET 4.5.1\u003c/li\u003e\n\u0009\u003cli\u003eC# 5.0\u003c/li\u003e\n\u0009\u003cli\u003eWindows Forms\u003c/li\u003e\n\u003c/ul\u003e\n","projectType":"","views":0,"roles":[{"name":"user"},{"name":"guest"}],"images":[{"link":"https://i.imgur.com/QGSMQwg.png"}],"__v":11},
{"_id":{"$oid":"5a40edd1d32e9b2885e18469"},"user":"","name":"Java ontwikkeling iPark, Parkeervergunning managementoplossing voor gemeenten","content":"\u003cp\u003eiPark is een Java EE web app waarin mensen een parkeervergunning kunnen aanvragen. De web app is voor diverse gemeenten en zorgt ervoor dat het uitgifteproces van parkeervergunningen voor burgers eenvoudiger en transparanter, en voor gemeenten effici\u0026euml;nter en sneller te laten verlopen.\u0026nbsp;\u003c/p\u003e\n\n\u003cp\u003eDe web app maakt gebruikt van de API van RDW om autogegevens op te halen via een kenteken. Dit wordt gedaan om te verifieren\u0026nbsp;dat het kenteken bestaat.\u0026nbsp;\u003c/p\u003e\n\n\u003cp\u003eIn teamverband ben ik betrokken als ontwikkelaar bij de realisatie van iPark. En tijdens het werken heb ik agile en scrum gebruikt.\u003c/p\u003e\n\n\u003cp\u003eVerder heb ik de onderstaande taken uitgevoerd:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eREST-API ontwikkeling;\u003c/li\u003e\n\u0009\u003cli\u003eGIS zoals: Google Maps/Map JavaScript API, pinpoint, gebruik aangevraagd latitude/ longitude punten, adres vinden, polygon/ polyline, events over map;\u0026nbsp;\u003c/li\u003e\n\u0009\u003cli\u003eHet aanpassen van gegevens van de aanvrager;\u003c/li\u003e\n\u0009\u003cli\u003eIn real time markers verwijderen in Google Maps m.b.v. Streams en Lambda functies;\u003c/li\u003e\n\u0009\u003cli\u003eReguliere expressies gebruikt voor het valideren van gegevens tijdens het aanvraagproces;\u003c/li\u003e\n\u0009\u003cli\u003eIn real time een aanvraag tussentijds opslaan;\u003c/li\u003e\n\u0009\u003cli\u003eWachtwoord vergeten systeem;\u003c/li\u003e\n\u0009\u003cli\u003eEntity model ontwerpen en ontwikkelen;\u003c/li\u003e\n\u0009\u003cli\u003eService en service implementatie;\u003c/li\u003e\n\u0009\u003cli\u003eTest omgeving opgezet in Spring en het schrijven van tests;\u003c/li\u003e\n\u0009\u003cli\u003eCode review;\u003c/li\u003e\n\u0009\u003cli\u003eRealiseren van koppelingen met open data sets van de overheid;\u003c/li\u003e\n\u0009\u003cli\u003eInrichten van de ontwikkelomgeving.\u003c/li\u003e\n\u0009\u003cli\u003eDocker container aangemaakt voor de Spring Boot applicatie\u003cbr /\u003e\n\u0009\u0026nbsp;\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eVoor de web app iPark heb ik de onderstaande technieken gebruikt:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eJava EE\u003c/li\u003e\n\u0009\u003cli\u003eGIT\u003c/li\u003e\n\u0009\u003cli\u003eJUnit\u003c/li\u003e\n\u0009\u003cli\u003eMockito\u003c/li\u003e\n\u0009\u003cli\u003eMaven\u003c/li\u003e\n\u0009\u003cli\u003eREST\u003c/li\u003e\n\u0009\u003cli\u003eJSON\u003c/li\u003e\n\u0009\u003cli\u003eSpring\u003c/li\u003e\n\u0009\u003cli\u003eSpring-boot\u003c/li\u003e\n\u0009\u003cli\u003eSpring Security\u003c/li\u003e\n\u0009\u003cli\u003eHibernate\u003c/li\u003e\n\u0009\u003cli\u003eJPA\u003c/li\u003e\n\u0009\u003cli\u003eGIS (Google Maps JavaScript API)\u003c/li\u003e\n\u0009\u003cli\u003eUML\u003c/li\u003e\n\u0009\u003cli\u003eAgile Scrum\u003c/li\u003e\n\u0009\u003cli\u003eHTML 5\u003c/li\u003e\n\u0009\u003cli\u003eCSS\u003c/li\u003e\n\u0009\u003cli\u003eAngularJS\u003c/li\u003e\n\u0009\u003cli\u003eSonarQube\u003c/li\u003e\n\u0009\u003cli\u003ePostgreSQL\u003c/li\u003e\n\u0009\u003cli\u003eJIRA\u003c/li\u003e\n\u0009\u003cli\u003eJenkins\u003c/li\u003e\n\u0009\u003cli\u003eAgile Scrum\u003c/li\u003e\n\u0009\u003cli\u003eDocker\u003c/li\u003e\n\u003c/ul\u003e\n","projectType":"","views":0,"roles":[{"name":"user"},{"name":"guest"}],"images":[{"link":"https://i.imgur.com/KS7MTBc.png"}],"__v":2},
{"_id":{"$oid":"5a415da7812a630de5ee3aa5"},"user":"","name":"Vega","content":"\u003cp\u003eIn mijn vrije tijd heb ik een full stack web applicatie ontwikkeld. De web applicatie is een autodealer web app geschreven in C# en maakt gebruik van ASP.NET Core en Angular 4. In de webapp kan een auto dealer een auto maken, tonen, aanpassen en verwijderen. Voor het geautomatiseerd testen heb ik het test framework Jasmine gebruikt. Daarnaast heb ik de gebruikerservaring geautomatiseerd m.b.v. Sentry. Dit betekent dat wanneer een gebruiker in de productie omgeving een error krijgt. Dat hij dan dit niet aan de developer hoeft te vertellen. De developer krijgt dan automatisch de error log van Sentry.\u003c/p\u003e\n\n\u003cp\u003eBij het ontwikkelen van de web app heb ik de volgende taken uitgevoerd:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eHet implementeren van Angular 4 en ASP.NET Core;\u003c/li\u003e\n\u0009\u003cli\u003eAPI\u0026rsquo;s bouwen met ASP.NET Core;\u003c/li\u003e\n\u0009\u003cli\u003eHet implementeren van een nette en ontkoppeld architectuur;\u003c/li\u003e\n\u0009\u003cli\u003eHet begrijpen en toepassen van Dependency Inversion Principle (DIP);\u003c/li\u003e\n\u0009\u003cli\u003eHet implementeren van de repository en unit of work patterns;\u003c/li\u003e\n\u0009\u003cli\u003eHet implementeren van de mapping van domain model naar API resources en andersom;\u003c/li\u003e\n\u0009\u003cli\u003eHet implementeren van CRUD operaties (inclusief one-to-many en many-to-many relaties);\u003c/li\u003e\n\u0009\u003cli\u003eHet implementeren van filteren, sorteren en paging van data;\u003c/li\u003e\n\u0009\u003cli\u003eHet weergeven van toast notificaties;\u003c/li\u003e\n\u0009\u003cli\u003eHet implementeren van cascading drop-down lists;\u003c/li\u003e\n\u0009\u003cli\u003eHet implementeren van een generiek query result systeem om het totaal aantal voertuigen te tonen;\u003c/li\u003e\n\u0009\u003cli\u003eHet implementeren van een foto upload systeem met progress bars;\u003c/li\u003e\n\u0009\u003cli\u003eHet implementeren van authenticatie en autorisatie met Auth0 (inclusief rollen met verschillende rechten);\u003c/li\u003e\n\u0009\u003cli\u003eHet weergeven van charts;\u003c/li\u003e\n\u0009\u003cli\u003eHet optimaliseren van de query om de lijst met voertuigen op te halen;\u003c/li\u003e\n\u0009\u003cli\u003eEen service layer extracten;\u003c/li\u003e\n\u0009\u003cli\u003eHet toevoegen van support voor verschillende storages (door interfaces te gebruiken);\u003c/li\u003e\n\u0009\u003cli\u003eHet gebruiken van de secret manager tool in ASP.NET Core\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eVerder heb ik de onderstaande technieken gebruikt:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eVisual Studio\u003c/li\u003e\n\u0009\u003cli\u003eC#\u003c/li\u003e\n\u0009\u003cli\u003eASP.NET Core\u003c/li\u003e\n\u0009\u003cli\u003eKestrel (cross platform server)\u003c/li\u003e\n\u0009\u003cli\u003eSQL Server\u003c/li\u003e\n\u0009\u003cli\u003eEntity Framework Core\u003c/li\u003e\n\u0009\u003cli\u003eLINQ\u003c/li\u003e\n\u0009\u003cli\u003eYeoman\u003c/li\u003e\n\u0009\u003cli\u003eAngular 4\u003c/li\u003e\n\u0009\u003cli\u003eJasmine\u003c/li\u003e\n\u0009\u003cli\u003eKarma\u003c/li\u003e\n\u0009\u003cli\u003eHTML5\u003c/li\u003e\n\u0009\u003cli\u003eCSS3\u003c/li\u003e\n\u0009\u003cli\u003eBootstrap\u003c/li\u003e\n\u0009\u003cli\u003eSentry\u003c/li\u003e\n\u003c/ul\u003e\n","projectType":"","views":0,"roles":[{"name":"guest"},{"name":"user"}],"images":[{"link":"https://i.imgur.com/ekxd2Zs.png"}],"__v":21},
{"_id":{"$oid":"5a42aed9e43d3730f290b784"},"user":"","name":"Realisatie toegang onderhoudsaannemers tot PenB","content":"\u003cp\u003eProefvakken \u0026amp; Boorkernen (PenB) is een web applicatie waaraan ik mee heb ontwikkeld. De web applicatie is voor de Rijkswaterstaat. Met behulp van deze web applicatie wordt onder andere vorstschade aan rijkswegen ingevoerd, bijgehouden en gerapporteerd. Deze applicatie maakt gebruik van ASP.NET en SQL Server Reporting Service (SSRS) voor het genereren van rapportages.\u0026nbsp;\u003c/p\u003e\n\n\u003cp\u003eMomenteel worden schades gemeld bij het Steunpunt Wegonderhoud en door weginspecteurs. Om de onderhoudsaannemers die vorstschades op weg aantreffen de mogelijkheid te geven deze te rapporteren en te repareren, is door Rijkswaterstaat besloten hen beperkt toegang te geven tot PenB. Om dit te realiseren, heb ik als software ontwikkelaar de UI voor deze autorisaties aangepast.\u003c/p\u003e\n\n\u003cp\u003eVoor de web applicatie heb ik de onderstaande technieken gebruikt:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eWeb Forms\u003c/li\u003e\n\u0009\u003cli\u003eC#\u003c/li\u003e\n\u0009\u003cli\u003eASP.NET\u003c/li\u003e\n\u0009\u003cli\u003eJQuery UI\u003c/li\u003e\n\u0009\u003cli\u003eJavascript\u003c/li\u003e\n\u0009\u003cli\u003eLINQ\u003c/li\u003e\n\u0009\u003cli\u003eSQL Server 2008\u003c/li\u003e\n\u0009\u003cli\u003eHTML\u003c/li\u003e\n\u0009\u003cli\u003eCSS\u003c/li\u003e\n\u0009\u003cli\u003eSQL Server Reporting Service (SSRS)\u003c/li\u003e\n\u003c/ul\u003e\n","projectType":"","views":0,"roles":[{"name":"user"},{"name":"guest"}],"images":[{"link":"https://i.imgur.com/BOf0sTd.png"}],"__v":3},
{"_id":{"$oid":"5a5110ca7500ab0feed7bc22"},"user":"","name":"Software ontwikkeling Webapplicatie t.b.v. logistieke processen","content":"\u003cp\u003eBij CIMSOLUTIONS heb ik het trainingsprogramma Java van 2 maanden succesvol gevolgd. Volgens een Agile/Scrum aanpak en onder begeleiding van 2 senior Java Ontwikkelaars, heb ik gewerkt aan het realiseren van een werkende applicatie om de logistieke processen van een transportbedrijf te automatiseren.\u0026nbsp;\u003c/p\u003e\n\n\u003cp\u003eDe applicatie bestaat uit 2 onderdelen, te weten een back end en een front end. De back end bestaat uit een Java webservice en als front end is een Angular applicatie gebouwd die met de back end communiceert. Vanuit de front end kan de gebruiker bestellingen plaatsen en die toekennen aan een klant. Nadat een bestelling geplaatst is, kunnen deze bestellingen worden verdeeld aan de chauffeurs. Tijdens de verdeling van bestellingen wordt tevens de kortste route berekend voor de chauffeurs via een rekenalgoritme. De gebruiker krijgt een lijst te zien met de kortste routes voor elke chauffeur, de bestellingen en een bezorglijst met de producten die een klant besteld heeft. \u0026nbsp;\u003c/p\u003e\n\n\u003cp\u003eVoor de applicatie heb ik de volgende onderdelen ontwikkeld en via JUnit getest:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eOpzetten back end (database, Java EE project) waarbij er gebruikt wordt gemaakt van het MVC (Model view controller) en de facade pattern);\u003c/li\u003e\n\u0009\u003cli\u003ePlaatsen van een bestelling (zowel back end als front end) waarbij er gebruikt wordt gemaakt van de factory pattern;\u003c/li\u003e\n\u0009\u003cli\u003eBijwerken leveringsstatus (zowel back end als front end);\u003c/li\u003e\n\u0009\u003cli\u003eBezorglijst weergeven (zowel back end als front end);\u003c/li\u003e\n\u0009\u003cli\u003eKortste route berekenen (zowel back end als front end);\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eDaarnaast heb ik de\u0026nbsp;documentatie geschreven betreft de requirements, installatie en het runnen van tests van de webapplicatie.\u003c/p\u003e\n\n\u003cp\u003eAan het einde van het trainingsprogramma is er een werkende webapplicatie opgeleverd voor acceptatietest voor de product owners.\u0026nbsp;\u003c/p\u003e\n\n\u003cp\u003eVerder had ik de onderstaande techieken gebruikt:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eJIRA\u003c/li\u003e\n\u0009\u003cli\u003eMaven\u003c/li\u003e\n\u0009\u003cli\u003eGIT\u003c/li\u003e\n\u0009\u003cli\u003eJava 8\u003c/li\u003e\n\u0009\u003cli\u003eJEE 7\u003c/li\u003e\n\u0009\u003cli\u003eJAX-RS\u003c/li\u003e\n\u0009\u003cli\u003eApache Tomcat\u003c/li\u003e\n\u0009\u003cli\u003epostgreSQL\u003c/li\u003e\n\u0009\u003cli\u003eUnit Testen\u003c/li\u003e\n\u0009\u003cli\u003eJenkins\u003c/li\u003e\n\u0009\u003cli\u003eTDD\u003c/li\u003e\n\u0009\u003cli\u003eGoogle Maps API\u003c/li\u003e\n\u0009\u003cli\u003eAngular 2\u003c/li\u003e\n\u0009\u003cli\u003eJSON\u003c/li\u003e\n\u0009\u003cli\u003eAgile Scrum\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\n","projectType":"","views":0,"roles":[{"name":"user"}],"images":[{"link":"https://i.imgur.com/WDwfXHu.png"}],"__v":5},
{"_id":{"$oid":"5a5146767500ab0feed7bc23"},"user":"","name":"ED web applicatie","content":"\u003cp\u003eDe Euthanasie database (ED) is een web app die data bevat van mensen die al euthanasie hadden gepleegd. De overheid wilt weten hoeveel mensen euthanasie hadden gepleegd.\u0026nbsp;\u003c/p\u003e\n\n\u003cp\u003eVoor het ministerie van Volksgezondheid, Welzijn en Sport heb ik de onderstaande functionaliteiten gebouwd en taken uitgevoerd:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eAanpassingen uitgevoerd in de front end\u003c/li\u003e\n\u0009\u003cli\u003eOordeelbrief optie toegevoegd bij het aanmaken van een dossier\u003c/li\u003e\n\u0009\u003cli\u003eImplementatie detectie gemaakt waarin een document geforceerd wordt opgeslagen als je de pagina verlaat\u003c/li\u003e\n\u0009\u003cli\u003eOordeelbrief aanpaspagina gemaakt voor de functioneelbeheerder waarin hij een oordeelbrief sjabloon kan maken/wijzigen.\u003c/li\u003e\n\u0009\u003cli\u003eOordeelbrief sjabloon gemaakt, die gemaakt en gewijzigd kan worden door een functioneel beheerder\u003c/li\u003e\n\u0009\u003cli\u003eImplementatie detectie gemaakt tijdens het aanmaken en afhandelen van het dossier. Dan moet het Oordeelbrief sjabloon toegewezen worden aan het \u0026nbsp;nieuwe dossier en getoond worden als je voor de optie oordeelbrief hebt gekozen.\u003c/li\u003e\n\u0009\u003cli\u003eAantal oordeelbrieven per regio, oordeelbrieven totaal en totaal berekening gemaakt en weergegeven in rapportage\u003c/li\u003e\n\u0009\u003cli\u003eVoorselectie handtekening voorzitter en oordeel gemaakt\u003c/li\u003e\n\u0009\u003cli\u003eNieuwe status ODB (oordeelbrief) toevoegen aan dossier\u003c/li\u003e\n\u0009\u003cli\u003eRechtenmatrix opgezet en gemaakt\u003c/li\u003e\n\u0009\u003cli\u003eBugs oplossen\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\n\n\u003cp\u003eVerder heb ik de onderstaande technieken gebruikt:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eAgile Scrum\u003c/li\u003e\n\u0009\u003cli\u003eHTML5\u003c/li\u003e\n\u0009\u003cli\u003eCSS3\u003c/li\u003e\n\u0009\u003cli\u003eJavaScript\u003c/li\u003e\n\u0009\u003cli\u003ePHP\u003c/li\u003e\n\u0009\u003cli\u003eExpressionEngine\u003c/li\u003e\n\u0009\u003cli\u003eLinux\u003c/li\u003e\n\u0009\u003cli\u003ebash scripting\u003c/li\u003e\n\u0009\u003cli\u003eMySQL\u003c/li\u003e\n\u0009\u003cli\u003eSVN\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\n","projectType":"","views":0,"roles":[{"name":"user"}],"images":[{"link":"https://i.imgur.com/gYKM0Ee.png"}],"__v":2},
{"_id":{"$oid":"5a522d0bc2c7ed2b9103461f"},"user":"","name":"Node-portfolio-zaky","content":"\u003cp\u003eNode-portfolio-zaky is mijn nieuwe portfolio web applicatie. De web applicatie is een Node.js web app die de MEAN (MongoDB, Express.js, Angular 4 en Node.js) stack gebruikt.\u0026nbsp;\u003c/p\u003e\n\n\u003cp\u003eDe webapp wordt gebruikt om mijn portfolio aan mensen te laten zien. En hen informatie te geven over mijn skills.\u003c/p\u003e\n\n\u003cp\u003e\u0026nbsp;Bij het ontwikkelen van de webapp heb ik de onderstaande taken uitgevoerd:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eserver opgezet m.b.v. Express.js;\u003c/li\u003e\n\u0009\u003cli\u003eMongoDB database opgezet;\u003c/li\u003e\n\u0009\u003cli\u003etest omgeving opgezet;\u003c/li\u003e\n\u0009\u003cli\u003ehet registreren van gebruikers (back end);\u003c/li\u003e\n\u0009\u003cli\u003ehet inloggen van gebruikers (zowel back end als front end);\u0026nbsp;\u003c/li\u003e\n\u0009\u003cli\u003eCRUD module gemaakt voor projecten;\u003c/li\u003e\n\u0009\u003cli\u003epagination gemaakt voor projecten;\u003c/li\u003e\n\u0009\u003cli\u003efuzzy search geimplementeerd voor projecten;\u003c/li\u003e\n\u0009\u003cli\u003eTimeline geimplementeerd;\u003c/li\u003e\n\u0009\u003cli\u003etests geschreven;\u003c/li\u003e\n\u0009\u003cli\u003eTravis CI opgezet voor continuous integration;\u003c/li\u003e\n\u0009\u003cli\u003eAngular 2 opgezet voor in de front end.\u003c/li\u003e\n\u0009\u003cli\u003eAngular 2 geupgrade naar Angular 4\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eVerder heb ik de onderstaande technieken gebruikt:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eMongoose\u003c/li\u003e\n\u0009\u003cli\u003eMongoDB\u003c/li\u003e\n\u0009\u003cli\u003eMocha\u003c/li\u003e\n\u0009\u003cli\u003eChai\u003c/li\u003e\n\u0009\u003cli\u003eNode.js\u003c/li\u003e\n\u0009\u003cli\u003eExpress.js\u003c/li\u003e\n\u0009\u003cli\u003eMiddleware\u003c/li\u003e\n\u0009\u003cli\u003eTravis CI\u003c/li\u003e\n\u0009\u003cli\u003enpm\u003c/li\u003e\n\u0009\u003cli\u003eAngular 2\u003c/li\u003e\n\u0009\u003cli\u003eAngular 4\u003c/li\u003e\n\u0009\u003cli\u003eTypeScript\u003c/li\u003e\n\u0009\u003cli\u003eBower\u003c/li\u003e\n\u0009\u003cli\u003eJSON\u003c/li\u003e\n\u0009\u003cli\u003eHTML5\u003c/li\u003e\n\u0009\u003cli\u003eBootstrap 3\u003c/li\u003e\n\u0009\u003cli\u003eSass\u003c/li\u003e\n\u0009\u003cli\u003eGulp\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\n","projectType":"","views":0,"roles":[{"name":"user"},{"name":"guest"}],"images":[{"link":"https://i.imgur.com/KFrHtxJ.png"}],"__v":1},
{"_id":{"$oid":"5a522ff2c2c7ed2b91034620"},"user":"","name":"robot-game","content":"\u003cp\u003eRobot-game is een 2D game en het is een desktop\u0026shy;applicatie geschreven in Java 8. In de robotgame speel je als robot die een level moet doorlopen. Bij het doorlopen van een level zijn er verschillende obstakels o.a. enemies. Als robot heb je een wapen die je kan gebruiken om de enemies uit te schakelen. De robotgame is verder nog in ontwikkeling.\u003c/p\u003e\n\n\u003cp\u003eBij het ontwikkelen van de game heb ik de onderstaande taken uitgevoerd:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003ehet toevoegen van een oneindige game loop en een frame;\u003c/li\u003e\n\u0009\u003cli\u003ehet aannemen van user input bijv. als er op het rechterpijl wordt gedrukt;\u003c/li\u003e\n\u0009\u003cli\u003ehet toevoegen van de beweeg functionaliteit voor de robot o.a. bukken, springen en lopen;\u003c/li\u003e\n\u0009\u003cli\u003ehet toevoegen van een scrollende achtergrond. Dit gebeurt wanneer je bijv. naar rechts loopt met de robot;\u003c/li\u003e\n\u0009\u003cli\u003ehet toevoegen van enemies;\u003c/li\u003e\n\u0009\u003cli\u003ehet toevoegen van schietende kogels die de robot kan afvuren;\u003c/li\u003e\n\u0009\u003cli\u003ehet toevoegen van tiles en een scrollende achtergrond (parallax scrolling);\u003c/li\u003e\n\u0009\u003cli\u003ehet maken van een botsing detectiesysteem.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eVerder heb ik de onderstaande technieken gebruikt:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eJava 8\u003c/li\u003e\n\u0009\u003cli\u003eAWT\u003cbr /\u003e\n\u0009\u0026nbsp;\u003c/li\u003e\n\u003c/ul\u003e\n","projectType":"","views":0,"roles":[{"name":"user"},{"name":"guest"}],"images":[{"link":"https://i.imgur.com/9u5AXP7.png"}],"__v":2},
{"_id":{"$oid":"5a523a33c2c7ed2b91034621"},"user":"","name":"Webshop/CMS LegalThings","content":"\u003cp\u003eLegalThings heeft een applicatie ontwikkeld waarmee advocaten, notarissen en zakelijke dienstverleners een bedrijf kunnen oprichten of (contracten, overeenkomsten) kunnen aanpassen. Naar aanleiding van de behoefte aan voorbeeldcontracten heeft LegalThings de tool/applicatie doorontwikkeld zodat ondernemers zelf voorbeeldcontracten kunnen opstellen (arbeidsovereenkomst, koopovereenkomst of een stageovereenkomst). Deze voorbeeldcontracten mogen alleen gemaakt worden, nadat er een betaling is gedaan. Dit is tevens de aanleiding geweest om een webshop/CMS te ontwikkelen om de voorbeeldcontracten te kunnen verkopen.\u0026nbsp;\u003c/p\u003e\n\n\u003cp\u003eMet behulp van een back-end framework heb ik een webshop ontwikkeld die gebruik maakt van de micro (web)services van LegalThings om de voorbeeldcontracten via de webshop te kunnen aanbieden. Daarnaast is er nog een webshop gemaakt met behulp van een CMS. Hiervoor heb ik een plugin en library ontwikkeld die gebruik maakt van de microservices om de voorbeeldcontracten in de webshop te kunnen aanbieden. Daarnaast heb ik de tests geschreven en uitgevoerd voor de gemaakte plugin. De OAuth server heb ik ontwikkeld met behulp van een OAuth server library.\u003c/p\u003e\n\n\u003cp\u003eVoor mijn werkzaamheden bij het ontwikkelen van de webshops heb ik o.a. gebruik gemaakt van Angular en Laravel (PHP back end framework), OAuth server (voor authenticatie) en plugin in Wordpress. De plugin is gemaakt om de contracten aan te bieden in Wordpress.\u003c/p\u003e\n","projectType":"","views":0,"roles":[{"name":"user"},{"name":"guest"}],"images":[{"link":"https://i.imgur.com/8FhRVZw.png"}],"__v":2},
{"_id":{"$oid":"5a53e1fe4099591872c0eb16"},"user":"","name":"Social media webapplicatie","content":"\u003cp\u003eIn mijn vrije tijd heb ik een Social Media webapplicatie ontwikkeld. In de webapp kan een gebruiker zich registreren of inloggen. Nadat een gebruiker zich heeft geregistreerd ontvangt hij een e-mail om zijn account te activeren.\u003c/p\u003e\n\n\u003cp\u003eVervolgens kan de gebruiker vrienden worden met andere gebruikers. Of als een gebruiker al bevriend is met een andere gebruiker kan hij hem blokkeren. Wanneer een gebruiker een vriendschapverzoek verstuurd naar een andere gebruiker, dan krijgt de andere gebruiker een notificatie met het vriendschapverzoek.\u003c/p\u003e\n\n\u003cp\u003eDe gebruikers kunnen ook onderling berichten naar elkaars profielpagina versturen en ontvangen. Een gebruiker kan ook op zijn profielpagina afbeeldingen uploaden in zijn fotogallerij. De fotogallerij van een gebruiker is dan ook te zien voor andere gebruikers.\u0026nbsp;\u003c/p\u003e\n\n\u003cp\u003eVoor de web app heb ik de volgende onderdelen ontwikkeld:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eregistratiesysteem;\u003c/li\u003e\n\u0009\u003cli\u003ee-mail activatiesysteem;\u003c/li\u003e\n\u0009\u003cli\u003elog in systeem;\u003c/li\u003e\n\u0009\u003cli\u003ewachtwoord vergeten systeem;\u003c/li\u003e\n\u0009\u003cli\u003efotogallerijsysteem;\u003c/li\u003e\n\u0009\u003cli\u003ebevrienden en blokkeren systeem;\u003c/li\u003e\n\u0009\u003cli\u003econversatiesysteem;\u003c/li\u003e\n\u0009\u003cli\u003enotificatiesysteem.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eDe technieken waarmee ik heb gewerkt zijn:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003ePHP\u003c/li\u003e\n\u0009\u003cli\u003eApache\u003c/li\u003e\n\u0009\u003cli\u003eMySQL\u003c/li\u003e\n\u0009\u003cli\u003eJavaScript\u003c/li\u003e\n\u0009\u003cli\u003eHTML\u003c/li\u003e\n\u0009\u003cli\u003eCSS\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\n","projectType":"","views":0,"roles":[{"name":"user"},{"name":"guest"}],"images":[{"link":"https://i.imgur.com/yt3GZAy.png"}],"__v":1},
{"_id":{"$oid":"5a53e7c74099591872c0eb17"},"user":"","name":"Atra","content":"\u003cp\u003eAtra is een Node.js webapp van een vriend van me. Ik mocht van hem ook eraan zitten werken in mijn vrije tijd. Hierin heb ik een bijdrage gegeven aan de volgende onderdelen:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eProjects cms systeem\u003c/li\u003e\n\u0009\u003cli\u003eGame (Pong)\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eDe technieken waarmee ik heb gewerkt zijn o.a.:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eExpress.js (Node.js back-end framework)\u003c/li\u003e\n\u0009\u003cli\u003eAngularJS (front-end framework)\u003c/li\u003e\n\u0009\u003cli\u003eSocket.io\u003c/li\u003e\n\u0009\u003cli\u003eMongoose\u003c/li\u003e\n\u003c/ul\u003e\n","projectType":"","views":0,"roles":[{"name":"user"},{"name":"guest"}],"images":[{"link":"https://i.imgur.com/7LelUIc.png"}],"__v":0},
{"_id":{"$oid":"5a551fac31cc2917356b6199"},"user":"","name":"Project Digital Learning","content":"\u003cp\u003eHet project Digital Learning is een project waarin ik met studenten richting Software Engineering een webapp heb gemaakt. De webapp Digital Learning moest ervoor zorgen dat studenten uit Nederland en buiten Nederland zich in kunnen schrijven voor een course. Nadat ze ingeschreven staan, moeten ze vervolgens een betaling doen.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eTaken die ik heb verricht\u003c/strong\u003e\u003c/p\u003e\n\n\u003cp\u003eOp het gebied van programmeren heb ik de onderstaande onderdelen gemaakt:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eregisteren van een gebruiker\u003c/li\u003e\n\u0009\u003cli\u003edat een gebruiker zijn profiel kan aanpassen\u003c/li\u003e\n\u0009\u003cli\u003echatroom\u003c/li\u003e\n\u0009\u003cli\u003edat een gebruiker een bericht kan versturen, ontvangen, verwijderen en op kan slaan als draft\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eVoor de documentatie van de artifacts heb ik de volgende onderdelen gemaakt:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eSupplementary Specification\u003c/li\u003e\n\u0009\u003cli\u003eGlossary\u003c/li\u003e\n\u0009\u003cli\u003eSystem Sequence diagrams\u003c/li\u003e\n\u0009\u003cli\u003eDesign Sequence diagrams\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eVerder had ik voor de documentatie van de handleiding de volgende onderdelen gemaakt:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eRegistreren\u003c/li\u003e\n\u0009\u003cli\u003eProfiel bewerken\u003c/li\u003e\n\u0009\u003cli\u003eChatroom\u003c/li\u003e\n\u0009\u003cli\u003eBerichten\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003e\u003cstrong\u003eTechnieken\u003c/strong\u003e\u003c/p\u003e\n\n\u003cp\u003eVoor de webapp Digital Learning heb ik de volgende technieken gebruikt:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eJ2EE\u003c/li\u003e\n\u0009\u003cli\u003eHibernate (ORM)\u003c/li\u003e\n\u0009\u003cli\u003eHTML\u003c/li\u003e\n\u0009\u003cli\u003eCSS\u003c/li\u003e\n\u0009\u003cli\u003ejQuery\u003c/li\u003e\n\u003c/ul\u003e\n","projectType":"","views":0,"roles":[{"name":"user"},{"name":"guest"}],"images":[{"link":"https://i.imgur.com/VPMpKmG.png"}],"__v":0},
{"_id":{"$oid":"5a5520a431cc2917356b619a"},"user":"","name":"Aanwezigheids webapp","content":"\u003cp\u003eTijdens het project Prove IT heb ik samen met mijn projectgroep een Aanwezigheids webapp gemaakt in PHP. Prove IT is een project waarin je in een groep met studenten zit van andere richtingen. Voor de Aanwezigheids webapp zat ik toen met de volgende mensen in de groep:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003esystem en network engineering student\u003c/li\u003e\n\u0009\u003cli\u003etwee game technology studenten\u003c/li\u003e\n\u0009\u003cli\u003egame design student\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eDe Aanwezigheids webapp zoals de naam het al zegt, moet ervoor zorgen dat studenten zich aanwezig moeten melden voor een les van een vak. Dit wordt bereikt nadat een docent een les heeft aangemaakt van een vak. De docent kan dan een start en eindtijd aangeven, zodat studenten binnen de gegeven tijd zich aanwezig kunnen melden. De docent kan ook een lessoncode maken of deze laten genereren.\u0026nbsp;Nadat de student zich heeft ingelogd hoeft hij alleen de\u0026nbsp;lessoncode in te voeren. En dan staat\u0026nbsp;hij in het systeem aanwezig\u0026nbsp;voor een les.\u003cbr /\u003e\n\u003cbr /\u003e\n\u003cstrong\u003eTaken die ik heb verricht\u003c/strong\u003e\u003c/p\u003e\n\n\u003cp\u003eVoor de Aanwezigheids webapp heb ik de volgende taken gedaan:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eDat een student vanaf en\u0026nbsp;binnen de gegeven tijd zich aanwezig kan melden\u003c/li\u003e\n\u0009\u003cli\u003eCMS systeem voor vakken die onder voltijd, deeltijd of duaal vallen\u003c/li\u003e\n\u0009\u003cli\u003eCMS systeem lessen die onder een vak vallen\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003e\u003cstrong\u003eTechnieken\u003c/strong\u003e\u003c/p\u003e\n\n\u003cp\u003eVoor de Aanwezigheids webapp heb ik de volgende technieken gebruikt:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003ePHP\u003c/li\u003e\n\u0009\u003cli\u003eMySQL\u003c/li\u003e\n\u0009\u003cli\u003eHTML\u003c/li\u003e\n\u0009\u003cli\u003eCSS\u003c/li\u003e\n\u0009\u003cli\u003eBootstrap 3\u003c/li\u003e\n\u0009\u003cli\u003ejQuery\u003c/li\u003e\n\u003c/ul\u003e\n","projectType":"","views":0,"roles":[{"name":"user"},{"name":"guest"}],"images":[{"link":"https://i.imgur.com/eTHbFH6.png"}],"__v":0},
{"_id":{"$oid":"5a55215531cc2917356b619b"},"user":"","name":" Offerte tool","content":"\u003cp\u003eTijdens mijn stage bij Yellowfizz moest ik een offerte tool gaan maken. De offerte tool is een PHP webapp.\u0026nbsp;De tool moet ervoor zorgen\u0026nbsp;dat\u0026nbsp;werknemers en managers urenindicaties kunnen invullen en kunnen bijhouden. Op basis van de uren die ingevuld zijn door de werknemers kunnen managers nieuwe offertes opstellen.\u0026nbsp;\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eTaken die ik heb verricht\u003c/strong\u003e\u003c/p\u003e\n\n\u003cp\u003eVoor de offerte tool heb ik de volgende taken verricht:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eGebruikers \u0026amp; managers moeten kunnen inloggen.\u003c/li\u003e\n\u0009\u003cli\u003eManagers kunnen nieuwe orders aanmaken\u003c/li\u003e\n\u0009\u003cli\u003eGebruikers \u0026amp; managers kunnen nieuwe projecten aanmaken\u003c/li\u003e\n\u0009\u003cli\u003eGebruikers \u0026amp; managers kunnen nieuwe tasks aanmaken\u003c/li\u003e\n\u0009\u003cli\u003eGebruikers \u0026amp; managers kunnen projecten \u0026amp; tasks wijzigen\u003c/li\u003e\n\u0009\u003cli\u003eGebruikers \u0026amp; managers kunnen zoeken naar projecten \u0026amp; tasks\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003e\u003cstrong\u003eTechnieken\u003c/strong\u003e\u003c/p\u003e\n\n\u003cp\u003eVoor de offerte tool webapp heb\u0026nbsp;ik de volgende technieken gebruikt:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eLaravel 4\u003c/li\u003e\n\u0009\u003cli\u003eMySQL\u003c/li\u003e\n\u0009\u003cli\u003ejQuery\u003c/li\u003e\n\u0009\u003cli\u003eBootstrap 3\u003c/li\u003e\n\u0009\u003cli\u003eLess (CSS pre-processor)\u003c/li\u003e\n\u003c/ul\u003e\n","projectType":"","views":0,"roles":[{"name":"user"},{"name":"guest"}],"images":[{"link":"https://i.imgur.com/ZzF8JVc.png"}],"__v":0},
{"_id":{"$oid":"5a55384731cc2917356b619c"},"user":"","name":"Banners stage","content":"\u003cp\u003eTijdens mijn stage bij Yellowfizz moest ik naast het maken van een webapplicatie ook banners maken. Voor het designen van de banners heb ik Adobe Flash CS5.5.\u003c/p\u003e\n\n\u003cp\u003eOm de verschillende objecten te laten bewegen heb ik code geschreven. Hiervoor heb ik de programmeertaal\u0026nbsp;ActionScript 3 gebruikt.\u003c/p\u003e\n","projectType":"","views":0,"roles":[{"name":"user"},{"name":"guest"}],"images":[{"link":"https://i.imgur.com/RcZfIvo.png"}],"__v":1},
{"_id":{"$oid":"5a553a6f31cc2917356b619d"},"user":"","name":"Footbattle Zaky","content":"\u003cp\u003eFootbattle Zaky is een filmpje wat ik heb gemonteerd om mee te doen met een Footbattle van\u0026nbsp;Huawei en Ajax. In het filmpje heb ik verschillende effecten gebruikt o.a. popping out,\u0026nbsp;flickering en de twitch effect.\u003c/p\u003e\n\n\u003cp\u003eDe programma\u0026#39;s die ik gebruik heb tijdens het monteren:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eSony Vegas 13\u003c/li\u003e\n\u0009\u003cli\u003ePhotoshop CS6 (Voor de witte stroke om mijn lichaam en voor de tekst \u0026quot;Zaky Huraibi\u0026quot; en \u0026quot;Skillfull person\u0026quot;\u003c/li\u003e\n\u003c/ul\u003e\n","projectType":"","views":0,"roles":[{"name":"user"},{"name":"guest"}],"images":[{"link":"https://i.imgur.com/LaCeA2o.png"}],"__v":0},
{"_id":{"$oid":"5a56727de7d6c11d6335baf4"},"user":"","name":"Rekenkanjer","content":"\u003cp\u003eTijdens het project GetConnected zat ik in een groep van studenten van andere richtingen. Mijn groep bestond uit het volgende:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003e2x Software engineering studenten\u003c/li\u003e\n\u0009\u003cli\u003e2x System en networking engineering studenten\u003c/li\u003e\n\u0009\u003cli\u003e1x IT management student\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eMet mijn een projectgroep moesten we\u0026nbsp;een PHP web app maken voor de opdrachtgever van KlasseTV. Ze hadden namelijk ondervonden dat kinderen die school volgen, helaas in hun vrije tijd weinig tijd\u0026nbsp;besteden aan hun lesstof. Daarom wilt KlasseTV hier verandering aan brengen, zodat kinderen\u0026nbsp;beter kunnen gaan presteren op school.\u003cbr /\u003e\n\u003cbr /\u003e\nHiervoor hadden we eerst onderzoeksvragen geformuleerd om de probleemstelling te kunnen te beantwoorden. De onderzoeksvragen staan hieronder:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eWie is onze doelgroep?\u003c/li\u003e\n\u0009\u003cli\u003eWat is e-learning?\u003c/li\u003e\n\u0009\u003cli\u003eWat zijn de voordelen van e-learning?\u003c/li\u003e\n\u0009\u003cli\u003eWat houdt een kind bezig in zijn vrije tijd?\u003c/li\u003e\n\u0009\u003cli\u003eBesteden ouders genoeg tijd aan hun kinderen na schooltijd?\u003c/li\u003e\n\u0009\u003cli\u003eWaarom zou een kind gebruik willen maken van KlasseTV?\u003c/li\u003e\n\u0009\u003cli\u003eWat zijn de voordelen van het gebruik van het product voor de kind zowel als KlasseTV?\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eNadat we dat hadden gedaan kwamen we uit op het idee om een reken web app (genaamd Rekenkanjer) te bouwen. Die aan de eisen en wensen van de opdrachtgever en doelgroep sluiten.\u0026nbsp;\u003cbr /\u003e\n\u003cbr /\u003e\n\u003cstrong\u003ePlan van aanpak\u003c/strong\u003e\u003cbr /\u003e\nVoor het plan van aanpak hebben we 2 SNE\u0026rsquo;ers (system en network engineers)\u0026nbsp;die zich bezighouden met het opzetten van de server. En voor de webapplicatie is iedereen van ons groepje daarmee bezig.\u003cbr /\u003e\n\u003cbr /\u003e\nRekenkanjer moet ervoor om leerstof aan te bieden aan leerlingen uit groep 7 en 8. Zodat ze\u0026nbsp;thuis op een leuke en leerzame manier ermee kunnen\u0026nbsp;werken. Denk hierbij aan\u0026nbsp;rekenen met oppervlaktes, metend rekenen etc.\u0026nbsp;Onze doel is daarbij dat de kinderen juist beter gaan presteren op school. In de web app\u0026nbsp;zullen de volgende rekenkundige bewerkingen voorkomen:\u0026nbsp;optellen, aftrekken,\u0026nbsp;vermenigvuldigen, en delen. Nadat de leerling de opdrachten heeft gemaakt wordt er een score gegeven. Deze score is een indicatie om aan te geven hoe goed de leerlingen de opdrachten heeft gemaakt.\u003cbr /\u003e\n\u003cbr /\u003e\nDaarnaast moet de docent ook gebruik kunnen maken van Rekenkanjer. Nadat de docent ingelogd heeft,\u0026nbsp;kan hij de prestaties van de leerlingen zien.\u003cbr /\u003e\n\u003cbr /\u003e\n\u003cstrong\u003eTaken die ik heb verricht\u003c/strong\u003e\u003c/p\u003e\n\n\u003cp\u003eVoor Rekenkanjer\u0026nbsp;heb ik de volgende taken gedaan:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eDe documentatie gemaakt\u003c/li\u003e\n\u0009\u003cli\u003eKlassendiagram gemaakt voor de web\u0026nbsp;app\u003c/li\u003e\n\u0009\u003cli\u003eVragen systeem voor leerlingen\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003e\u003cstrong\u003eTechnieken\u003c/strong\u003e\u003c/p\u003e\n\n\u003cp\u003eVoor Rekenkanjer heb ik de volgende technieken gebruikt:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003ePHP\u003c/li\u003e\n\u0009\u003cli\u003eMySQL\u003c/li\u003e\n\u0009\u003cli\u003eHTML\u003c/li\u003e\n\u0009\u003cli\u003eCSS\u003c/li\u003e\n\u003c/ul\u003e\n","projectType":"","views":0,"roles":[{"name":"user"},{"name":"guest"}],"images":[{"link":"https://i.imgur.com/ATHKo82.png"}],"__v":0},
{"_id":{"$oid":"5a568118e7d6c11d6335baf5"},"user":"","name":"Project Outfit","content":"\u003cp\u003eProject Outfit was mijn eerste project aan de HvA. In dit project kregen we al een bestaande project waarin we moesten werken.\u0026nbsp;Het bestaande project was een webshop desktop applicatie. Alleen werkte de webshop nog niet goed omdat het bugs bevatte. Daarnaast was de webshop ook nog niet af, omdat het nog moest worden uitgebreid.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eTaken die ik heb verricht\u003c/strong\u003e\u003c/p\u003e\n\n\u003cp\u003eVoor project Outfit\u0026nbsp;heb ik de volgende taken gedaan:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eInlog systeem gemaakt\u003c/li\u003e\n\u0009\u003cli\u003eRegistreer systeem gemaakt\u003c/li\u003e\n\u0009\u003cli\u003eTimer gemaakt dus dat je eerst een scherm ziet en dat hij na een aantal seconden zich redirect naar het login scherm.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003e\u003cstrong\u003eTechnieken\u003c/strong\u003e\u003c/p\u003e\n\n\u003cp\u003eVoor de Aanwezigheids webapp heb ik de volgende technieken gebruikt:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eMySQL\u003c/li\u003e\n\u0009\u003cli\u003eJava\u003c/li\u003e\n\u003c/ul\u003e\n","projectType":"","views":0,"roles":[{"name":"user"},{"name":"guest"}],"images":[{"link":"https://i.imgur.com/4SZiMhF.png"}],"__v":0},
{"_id":{"$oid":"5a568868e7d6c11d6335baf6"},"user":"","name":"Kenzup","content":"\u003cp\u003eKenzup is een Adroid app dat ik in mijn vrije tijd heb gemaakt. Kenzup maakt gebruik van een HTTP library genaamd Volley om gebruikers te laten\u0026nbsp;registreren\u0026nbsp;of in te loggen. De requests voor het inloggen of registeren\u0026nbsp;wordt dan verstuurd naar mijn Node.js web app. Daarbij heb ik ook een MongoDB database waarin de\u0026nbsp;geregistreerde users worden opgeslagen.\u0026nbsp;Nadat je bent ingelogd kan je het weer opvragen door het ingevoerde stad als request sturen. Hiervoor maak ik gebruik van de\u0026nbsp;API van\u0026nbsp;OpenWeatherMap. Verder kan je in Kenzup afbeeldingen uploaden naar een server. Hiervoor maak ik gebruik van de API van Imgur.\u003cbr /\u003e\n\u003cbr /\u003e\nKenzup bestaat nu uit de volgende onderdelen:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eLog in\u0026nbsp;systeem\u003c/li\u003e\n\u0009\u003cli\u003eRegistratie systeem\u003c/li\u003e\n\u0009\u003cli\u003eWeer systeem\u003c/li\u003e\n\u0009\u003cli\u003eImage upload systeem\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eDe technieken waarmee ik heb gewerkt zijn:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eJava\u003c/li\u003e\n\u0009\u003cli\u003eSQLite\u003c/li\u003e\n\u0009\u003cli\u003eNode.js\u003c/li\u003e\n\u0009\u003cli\u003eExpress.js\u003c/li\u003e\n\u0009\u003cli\u003eMongoDB\u003c/li\u003e\n\u0009\u003cli\u003eMongoose\u003c/li\u003e\n\u003c/ul\u003e\n","projectType":"","views":0,"roles":[{"name":"user"},{"name":"guest"}],"images":[{"link":"https://i.imgur.com/VPyG66B.png"}],"__v":0},
{"_id":{"$oid":"5a568b82e7d6c11d6335baf7"},"user":"","name":"Portfolio-zaky","content":"\u003cp\u003ePortfolio-zaky is een PHP web app die ik gemaakt heb om mijn\u0026nbsp;portfolio aan mensen te laten zien.\u0026nbsp;En hen\u0026nbsp;informatie te geven over mijn skills.\u003c/p\u003e\n\n\u003cp\u003eBij het ontwikkelen van de webapp heb ik de volgende taken uitgevoerd:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eCRUD module gemaakt voor projecten;\u003c/li\u003e\n\u0009\u003cli\u003epagination gemaakt voor projecten;\u003c/li\u003e\n\u0009\u003cli\u003ehet registreren van gebruikers;\u003c/li\u003e\n\u0009\u003cli\u003ehet inloggen van gebruikers;\u0026nbsp;\u003c/li\u003e\n\u0009\u003cli\u003eMySQL database opgezet;\u003c/li\u003e\n\u0009\u003cli\u003efront end gemaakt voor de Home, Portfolio, C.V. en Over pagina;\u0026nbsp;\u003c/li\u003e\n\u0009\u003cli\u003ede web app gedeployed op de server;\u003c/li\u003e\n\u0009\u003cli\u003edocumentatie geschreven betreft de requirements en installatie die nodig is om de webapp te draaien.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eDe technieken waarmee ik heb gewerkt zijn o.a.:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eLaravel 5 (PHP\u0026nbsp;back-end framework)\u003c/li\u003e\n\u0009\u003cli\u003eMySQL\u003c/li\u003e\n\u0009\u003cli\u003eBootstrap 3 (front-end framework)\u003c/li\u003e\n\u003c/ul\u003e\n","projectType":"","views":0,"roles":[{"name":"user"},{"name":"guest"}],"images":[{"link":"https://i.imgur.com/81hPAa2.png"}],"__v":2},
{"_id":{"$oid":"5a5b30c4baaa97166560cf08"},"user":"","name":"Globetrotting","content":"\u003cp\u003eDe HvA (Hogeschool van Amsterdam) is de grootste Hogeschool van Nederland met 46.000 studenten. Bij de HvA werken 3.900 medewerkers.\u003cbr /\u003e\nTijdens het project WOSI heb ik in teamverband de doorontwikkeling van de bestaande webapplicatie Globetrotting verzorgd.\u0026nbsp;\u003c/p\u003e\n\n\u003cp\u003eDe Globetrotting webapplicatie zorgt ervoor dat ca. 100 (internationale) studenten zich kunnen inschrijven voor een vak, minor of traineeship danwel dat docenten gegevens over studenten kunnen invoeren.\u0026nbsp;\u003c/p\u003e\n\n\u003cp\u003eVoor de Globetrotting webapplicatie heb ik aan de volgende onderdelen gewerkt:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003evak/Minor/Internship registratie module voor studenten;\u0026nbsp;\u003c/li\u003e\n\u0009\u003cli\u003evak/Minor/Internship acceptatie module voor studenten;\u0026nbsp;\u003c/li\u003e\n\u0009\u003cli\u003eselectie module tbv mentor / contactpersoon / cluster / school;\u0026nbsp;\u003c/li\u003e\n\u0009\u003cli\u003eadmin module om gearchiveerde users te kunnen inzien;\u003c/li\u003e\n\u0009\u003cli\u003eCMS content beheer home page;\u003c/li\u003e\n\u0009\u003cli\u003etesten mailing functionaliteit inkomende en uitgaande studenten.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003e\u003cstrong\u003eTechnieken\u003c/strong\u003e\u003c/p\u003e\n\n\u003cp\u003eTijdens het ontwikkelen heb ik de onderstaande technieken gebruikt:\u003c/p\u003e\n\n\u003cul\u003e\n\u0009\u003cli\u003eSpring (back-end framework)\u003c/li\u003e\n\u0009\u003cli\u003eMaven\u003c/li\u003e\n\u0009\u003cli\u003eHibernate (ORM)\u003c/li\u003e\n\u0009\u003cli\u003eJPQL\u0026nbsp;(Java Persistence Query Language)\u003c/li\u003e\n\u0009\u003cli\u003eSass\u003c/li\u003e\n\u0009\u003cli\u003eBootstrap 3\u003c/li\u003e\n\u0009\u003cli\u003eHTML5\u003c/li\u003e\n\u0009\u003cli\u003ejQuery\u003c/li\u003e\n\u0009\u003cli\u003eAgile Scrum\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003e\u0026nbsp;\u003c/p\u003e\n","projectType":"","views":0,"roles":[{"name":"user"},{"name":"guest"}],"images":[{"link":"https://i.imgur.com/9AkjigT.png"}],"__v":0}
]
